<?php
/** +----------------------------------------------------------------------
 *  | 智安科技  -- 配置文件
 *  +----------------------------------------------------------------------
 *  | Copyright (c) 2015 智安科技  All rights reserved.
 *  +----------------------------------------------------------------------
 *  | Author: Cengp $
 *  +----------------------------------------------------------------------
 */

return array(

    /*设置允许访问列表和默认模块*/
    'MODULE_ALLOW_LIST' => array('Admin'), //允许访问模块列表
    //'MODULE_DENY_LIST'      =>  array('Pharmacist'),   //禁止访问模块列表
    'DEFAULT_MODULE'    => 'Admin', //默认模块

    'URL_MODEL'         => '2', //URL模式

    'URL_CASE_INSENSITIVE' => false,  // 区分大小写

    /* 扩展配置文件 */
    'LOAD_EXT_CONFIG'   => array('EXT_CONFIG' => EXT_CONFIG),


);
