<?php
/** +----------------------------------------------------------------------
 *  | 智安科技  -- 分类管理 模型
 *  +----------------------------------------------------------------------
 *  | Copyright (c) 2015 智安科技  All rights reserved.
 *  +----------------------------------------------------------------------
 *  | Author: Cengp $   2015-08-28
 *  +----------------------------------------------------------------------
 */
namespace Common\Model;

class ArticleCatModel extends CommonModel
{

	protected $connection = 'EXT_CONFIG';

    //自动验证
    protected $_validate = array(
        //array(验证字段,验证规则,错误提示,验证条件,附加规则,验证时间)
        array('name', 'require', '分类名不能为空！', 1, 'regex', 3),
    );

}

?>